#pragma once

#include <glad/glad.h>
#include <glm/glm.hpp>
#include <glm/gtc/matrix_transform.hpp>
#include <glm/gtc/type_ptr.hpp>

//        2────────3
//       /│       /│
//      / │      / │
//     6────────7  │
//     │  │     │  │
//     │  0─────│──1
//     │ /      │ /
//     │/       │/
//     4────────5
class Cube
{
public:
	glm::vec3 position;
	glm::vec3 rotation = glm::vec3(0, 0, 0);
	glm::vec3 size = glm::vec3(1, 1, 1);

	unsigned int VAO;
	unsigned int VBO;
	unsigned int EBO;

	// 큐브의 정점은 8개 이지만, 이 경우 그려지는 각 사각형 면 별로 별도의 uv가 할당될 필요가 있기에
	// 한 점을 공유하는 사각형의 개수(3) 만큼 곱한 8 * 3 = 24 개의 데이터가 전달된다.
	// 즉 실제 모델 데이터 자체가 아닌, OpenGL에 맞게 변환된 모습이라고 볼 수 있다.
	// (만약 삼각형 단위로 uv를 차별화 할 경우 더 많은 데이터가 필요할 수 있다)
	// (노멀의 경우도 마찬가지로, 같은 정점인데 그려지는 면 마다 값이 차별화될 경우 데이터 복사가 필요하다)
	float verticesData[120] = {
		// 앞
		 1,  1, -1,		0, 1, // 3 0
		 1, -1, -1,		0, 0, // 1 1
		-1, -1, -1,		1, 0, // 0 2
		-1,  1, -1,		1, 1, // 2 3

		// 뒤				  
		-1,  1,  1,		0, 1, // 6 4
		-1, -1,  1,		0, 0, // 4 5
		 1, -1,  1,		1, 0, // 5 6
		 1,  1,  1,		1, 1, // 7 7

		// 좌					  
		-1,  1, -1,		0, 1, // 2 8
		-1, -1, -1,		0, 0, // 0 9
		-1, -1,  1,		1, 0, // 4 10
		-1,  1,  1,		1, 1, // 6 11

		// 우					  
		 1,  1,  1,		0, 1, // 7 12
		 1, -1,  1,		0, 0, // 5 13
		 1, -1, -1,		1, 0, // 1 14
		 1,  1, -1,		1, 1, // 3 15

		// 상					  
		-1,  1, -1,		0, 1, // 2 16
		-1,  1,  1,		0, 0, // 6 17
		 1,  1,  1,		1, 0, // 7 18
		 1,  1, -1,		1, 1, // 3 19

		// 하					  
		-1,  -1,  1,	0, 1, // 4 20
		-1,  -1, -1,	0, 0, // 0 21
		 1,  -1, -1,	1, 0, // 1 22
		 1,  -1,  1,	1, 1, // 5 23
	};

	// 오른손 법칙 기준으로
	unsigned int indices[36] = {
		0, 1, 2,
		0, 2, 3,

		4, 5, 6,
		4, 6, 7,
		
		8, 9, 10,
		8, 10, 11,

		12, 13, 14,
		12, 14, 15,

		16, 17, 18,
		16, 18, 19,

		20, 21, 22,
		20, 22, 23
	};

	Cube(glm::vec3 pos);
	void keyInput(float deltaTime, bool Z, bool X, bool C, bool ctrl, bool kp1, bool kp2, bool kp3);
	void Draw();
};

//        2────────3
//       /│       /│
//      / │      / │
//     6────────7  │
//     │  │     │  │
//     │  0─────│──1
//     │ /      │ /
//     │/       │/
//     4────────5
class LightCube
{
public:
	glm::vec3 position;
	glm::vec3 rotation = glm::vec3(0, 0, 0);
	glm::vec3 size = glm::vec3(1, 1, 1);

	unsigned int VAO;
	unsigned int VBO;
	unsigned int EBO;

	float verticesData[192] = {
		// 앞
		 1,  1, -1,		0, 0, -1,	0, 1, // 3 0
		 1, -1, -1,		0, 0, -1,	0, 0, // 1 1
		-1, -1, -1,		0, 0, -1,	1, 0, // 0 2
		-1,  1, -1,		0, 0, -1,	1, 1, // 2 3

		// 뒤				  
		-1,  1,  1,		0, 0, 1, 	0, 1, // 6 4
		-1, -1,  1,		0, 0, 1, 	0, 0, // 4 5
		 1, -1,  1,		0, 0, 1, 	1, 0, // 5 6
		 1,  1,  1,		0, 0, 1, 	1, 1, // 7 7

		 // 좌					  
		 -1,  1, -1,	-1, 0, 0,	0, 1, // 2 8
		 -1, -1, -1,	-1, 0, 0,	0, 0, // 0 9
		 -1, -1,  1,	-1, 0, 0,	1, 0, // 4 10
		 -1,  1,  1,	-1, 0, 0,	1, 1, // 6 11

		 // 우					  
		  1,  1,  1,	1, 0, 0,	0, 1, // 7 12
		  1, -1,  1,	1, 0, 0,	0, 0, // 5 13
		  1, -1, -1,	1, 0, 0,	1, 0, // 1 14
		  1,  1, -1,	1, 0, 0,	1, 1, // 3 15

		  // 상					  
		  -1,  1, -1,	0, 1, 0,	0, 1, // 2 16
		  -1,  1,  1,	0, 1, 0,	0, 0, // 6 17
		   1,  1,  1,	0, 1, 0,	1, 0, // 7 18
		   1,  1, -1,	0, 1, 0,	1, 1, // 3 19

		   // 하					  
			-1,  -1,  1,	0, -1, 0,	0, 1, // 4 20
			-1,  -1, -1,	0, -1, 0,	0, 0, // 0 21
			 1,  -1, -1,	0, -1, 0,	1, 0, // 1 22
			 1,  -1,  1,	0, -1, 0,	1, 1, // 5 23
	};

	// 오른손 법칙 기준으로
	unsigned int indices[36] = {
		0, 1, 2,
		0, 2, 3,

		4, 5, 6,
		4, 6, 7,

		8, 9, 10,
		8, 10, 11,

		12, 13, 14,
		12, 14, 15,

		16, 17, 18,
		16, 18, 19,

		20, 21, 22,
		20, 22, 23
	};

	LightCube(glm::vec3 pos);
	void keyInput(float deltaTime, bool Z, bool X, bool C, bool ctrl, bool kp1, bool kp2, bool kp3);
	void Draw();
	glm::mat4 getModel();
};